# Написать программу вычисления значения функции y = f(a)

from tkinter import Y


a = int(input())
f = int(input())
y = f*a
print(y)