# Даны два числа. Показать большее и меньшее число

num1 = int(input('enter first num: '))
num2 = int(input('enter second num: '))
if num1 > num2:
    print(num1, 'bigger than', num2)
else:
    print(num2, 'bigger than', num1)
